#1.Создать переменную типа String
a = '10'
#2.Создать переменную типа Integer
b = 10
#3.Создать переменную типа Float
c = 10.0
#4.Создать переменную типа Bytes
d = b'10'
#5.Создать переменную типа List
e = [a, b, c]
#6.Создать переменную типа Tuple
f = (0, 1, 2, 3)
#7.Создать переменную типа Set
g = {'cat', 'dog', 'pig'}
#8.Создать переменную типа Frozen set
h = frozenset ({'cat', 'dog', 'pig'})
#9.Создать переменную типа Dict
i = {1: 'cat', 2: 'dog'}
#10.Вывести в консоль все выше перечисленные переменные с добавлением типа данных
print(a, type(a))
print(b, type(b))
print(c, type(c))
print(d, type(d))
print(e, type(e))
print(f, type(f))
print(g, type(g))
print (h, type(h))
print (i, type(i))
#11.Создать 2 переменные String, создать переменную в которой суммируете эти переменные. Вывести в консоль
string_1 = 'street'
string_2 = 'house'
string_sum = string_1+string_2
print (string_sum)
#12.Создать 2 переменные Integer, создать переменную в которой суммируете эти переменные. Вывести в консоль
int_1 = 8
int_2 = 3
int_sum = int_1+int_2
print (int_sum)
#13.Создать переменную в которой Разделите эти переменные Int. Вывести в консоль
int_div = int_1/int_2
print (int_div)
#14.Создать переменную в которой Умножите эти переменные Int. Вывести в консоль
int_mult = int_1*int_2
print (int_mult)
#15.Создать переменную в которой Разделите без остатка эти переменные Int. Вывести в консоль
int_div_0 = int_1//int_2
print (int_div_0)
#16.Создать переменную в которой надо присвоить остаток от деления этих переменные Int. Вывести в консоль
int_div_ost = int_1 % int_2
print (int_div_ost)
#17.(7 + 12)  3 + 7 * 4 - 44 / 2  4 расставить точки так чтобы получилось 6884.25. Вывести в консоль
print((7 + 12)**3 + 7 * 4 - 44 / 2**4)


